ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ПередачаВОтгрузку/ЖБИ_ПередачаВОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ПередачаВОтгрузку</name>
  <comment>ЖБИ - Передача в отгрузку</comment>
  <registerRecords>AccumulationRegister.ЖБИ_ПередачаВОтгрузку</registerRecords>
  <registerRecords>AccumulationRegister.ЖБИ_ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачиВОтгрузку</name>
    <comment>Дата передачи в отгрузку</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОдобренияОтгрузки</name>
    <comment>Дата одобрения отгрузки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Исходное кол-во</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазместитьВПлан</name>
      <comment>Разместить в план</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаАвто</name>
      <comment>Норма погрузки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдТранспорта</name>
      <comment>Ед транспорта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/AccumulationRegisters/ЖБИ_ДополнительныеРасходы/ЖБИ_ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖБИ_ДополнительныеРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДопЗатратыНаМатериалы</name>
    <comment>Доп. затр. на материалы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопРасходы</name>
    <comment>Доп. расходы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопЗатратыНаХвост</name>
    <comment>Доп. затр. на хвост</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаПокупателя</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_СтатусРасчетаСтавки/ЖБИ_СтатусРасчетаСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_СтатусРасчетаСтавки</name>
  <comment>ЖБИ - Статус расчета ставки</comment>
  <enumValues>
    <name>Расчет</name>
    <comment>Расчет</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
    <comment>В работе</comment>
  </enumValues>
  <enumValues>
    <name>Рассчитан</name>
    <comment>Рассчитан</comment>
  </enumValues>
  <enumValues>
    <name>РасчетИндивидуальныхЦен</name>
    <comment>Расчет индивидуальных цен</comment>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЛогистами</name>
    <comment>Подтверждение логистами</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
    <comment>Завершен</comment>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
    <comment>Не согласован</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ПередачаВОтгрузку/ObjectModule.bsl
Процедура РассчитатьСуммуВсего()
	
	СуммаДокумента = 0;
	Для Каждого НомСтр Из Товары Цикл 
		СуммаДокумента = СуммаДокумента + НомСтр.Сумма;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.Запись И НЕ ПометкаУдаления Тогда	
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	РассчитатьСуммуВсего();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЖБИ_ЗаявкиПокупателей") Тогда
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		//ЭтотОбъект.УстановитьНовыйНомер();
		//ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		//ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Товары.Загрузить(ДанныеЗаполнения.СчетНаОплату.Выгрузить());
		//Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
	Иначе
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ можно добавить только на основании Заявки покупателя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Рассчитан Тогда 
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		Документы.ЖБИ_ПередачаВОтгрузку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		ОтразитьПередачаВОтгрузку(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирования движений по регистру "ПередачаВОтгрузку".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьПередачаВОтгрузку(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПередачаВОтгрузку = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЖБИ_ПередачаВОтгрузку;	
	Если Отказ ИЛИ ТаблицаПередачаВОтгрузку.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыПоставщикам = Движения.ЖБИ_ПередачаВОтгрузку;
	ДвиженияЗаказыПоставщикам.Записывать = Истина;
	ДвиженияЗаказыПоставщикам.Загрузить(ТаблицаПередачаВОтгрузку);
	
	//
	ТаблицаДополнительныеРасходы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЖБИ_ДополнительныеРасходы;	
	Если Отказ ИЛИ ТаблицаДополнительныеРасходы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Удалим пустые строки
	ИндексПоследнего = ТаблицаДополнительныеРасходы.Количество() - 1;
	Для Индекс = 0 По ИндексПоследнего Цикл
		Если ТаблицаДополнительныеРасходы[ИндексПоследнего - Индекс].ДопЗатратыНаМатериалы = 0
			И ТаблицаДополнительныеРасходы[ИндексПоследнего - Индекс].ДопРасходы = 0 
			И ТаблицаДополнительныеРасходы[ИндексПоследнего - Индекс].ДопЗатратыНаХвост = 0 Тогда
			ТаблицаДополнительныеРасходы.Удалить(ИндексПоследнего - Индекс);	
		КонецЕсли;
	КонецЦикла;
	
	ДвиженияЗаказыПоставщикам = Движения.ЖБИ_ДополнительныеРасходы;
	ДвиженияЗаказыПоставщикам.Записывать = Истина;
	ДвиженияЗаказыПоставщикам.Загрузить(ТаблицаДополнительныеРасходы);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.НеСогласован;
КонецПроцедуры
